# استفاده از نسخه سبک و پایدار Node.js
FROM node:18-alpine

# تنظیم دایرکتوری کاری داخل کانتینر
WORKDIR /app

# کپی کردن فایل‌های وابستگی برای نصب پکیج‌ها (استفاده از کش داکر)
COPY package*.json ./

# نصب پکیج‌ها
RUN npm install

# کپی کردن تمام کد برنامه به داخل کانتینر
COPY . .

# ساخت بیلد نهایی پروژه (تولید پوشه dist)
RUN npm run build

# ایجاد پوشه آپلود برای جلوگیری از خطاهای احتمالی
RUN mkdir -p uploads

# باز کردن پورت ۴۰۰۰ (پورت برنامه شما)
EXPOSE 4000

# دستور شروع برنامه
CMD ["npm", "start"]

